// Дэлгэцтэй ажиллах контроллер

      // Convert List to Array
      // Орлого зарлагын элементийг агуулсан html-ийг бэлтгэнэ.
      // Тэр HTML дотроо орлого зарлагын утгуудыг REPLACE ашиглаж өөрчилж

// Санхүүтэй ажиллах контроллер
  // private data

  // private data

  // private data
      // Нийт орлогын нийлбэрийг тооцоолно

      // Нийт зарлагын нийлбэрийг тооцоолно

      // Төсвийг шинээр тооцоолно
      // Орлого зарлагын хувийг тооцоолно

// Програмын холбогч контроллер
    // 1. Оруулах өгөгдлийг дэлгэцээс олж авна.
      // 2. Олж авсан өгөгдлүүдээ санхүүгийн контроллерт дамжуулж тэнд хадгална.
      // 3. Олж авсан өгөгдлүүдээ вэб дээрээ тохирох хэсэгт нь гаргана
      // 4. Төсвийг тооцоолно
      // 5. Эцсийн үлдэгдэл,

      // 6. Төсвийн тооцоог дэлгэцэнд гаргана.
